init.el

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

;; Make gc pauses faster by decreasing the threshold.
(setq gc-cons-threshold (* 2 1000 1000))
